[
  {
    "id": 733,
    "title": "Подкаст с марсохода: новые записи красной планеты",
    "guid": "https://habr.com/ru/post/544238/",
    "source_id": 93,
    "content": "<p>На днях замдиректора научного подразделения NASA поделился с общественностью новостью о выходе новых записей с борта Perseverance. Он предположил, что звуки Марса заинтересуют не только ученых и широкую аудиторию, но и станут основой для творчества музыкантов.</p> <a href=\"https://habr.com/ru/post/544238/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544238#habracut\">Читать далее</a>",
    "date": "2021-02-25T20:48:44",
    "image": null,
    "starred": null
  },
  {
    "id": 734,
    "title": "Compaq Contura 410C: неигровое ретро",
    "guid": "https://habr.com/ru/post/544276/",
    "source_id": 93,
    "content": "До недавнего времени все портативные компьютеры в моей коллекции относились к «поздней» эпохе, имея на борту как минимум процессор Pentium MMX. Хотелось чего-то более древнего, но такие артефакты сложнее найти: речь идет об устройствах, которым минимум 25 лет. Чем дальше мы отправляемся в прошлое, тем дороже стоили ноутбуки, когда были новыми, тем меньше их покупали, а уж до наших времен дожили и вовсе немногие. Просто сохраниться до 2020 года, да еще в рабочем состоянии — уже достижение. К сожалению, любимые мной ноутбуки IBM ThinkPad на 486-м процессоре сейчас совсем трудно найти, но они были не единственные. Недавно мне попался недорогой артефакт из 1995 года, ноутбук Compaq Contura 410C. На сегодняшний день это самый древний лаптоп в моей коллекции. <br>\r\n<br>\r\n<div style=\"text-align:center;\"><img src=\"https://habrastorage.org/webt/y0/h7/ww/y0h7ww7nqyhti1seo0h_op2rnny.jpeg\"></div><br>\r\n<br>\r\nХотя подождите, в 1995 году уже два года как была доступны процессоры Pentium. Как так вышло, что в ноутбуках 486-й процессор задержался? Ну, во-первых времена были, по сравнению с нынешними, неторопливые. Во-вторых, в начале 95-го Intel только анонсировала «мобильные» версии Pentium с частотой от 75 мегагерц с рабочим напряжением 2.9 вольта. В августе 2005 года журнал PC Magazine проводит <a href=\"https://books.google.com/books?id=aS7TOePnRDAC\" rel=\"nofollow noopener noreferrer\">большой тест</a> сотни лаптопов, из которых четверть имеют на борту Pentium 75, 90 или 100. Все это — десктопные версии процессора в переносном корпусе, с крайне небольшим временем автономной работы. <br>\r\n<br>\r\nМежду тем, 486-го процессора в те времена было более чем достаточно для всех задач, особенно если не увлекаться играми. В моем новом-старом Compaq Contura это и не получится. Ладно звуковой карты нет — при желании это поправимо. Я впервые встретился с настоящим цветным дисплеем, сделанным по технологии DSTN. Осознал на практике весь тот уровень <i>страданий</i>, с которым четверть века назад сталкивались владельцы таких портативных компьютеров. Но выбора особо не было: TFT-матрицы были совершенно недоступны большинству людей, если покупать за свои. <br> <a href=\"https://habr.com/ru/post/544276/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544276#habracut\">Читать дальше &rarr;</a>",
    "date": "2021-02-25T20:48:35",
    "image": "https://habrastorage.org/webt/y0/h7/ww/y0h7ww7nqyhti1seo0h_op2rnny.jpeg",
    "starred": null
  },
  {
    "id": 732,
    "title": "[Перевод] Кодогенерацию с использованием Roslyn можно использовать и без перехода на .Net 5",
    "guid": "https://habr.com/ru/post/544274/",
    "source_id": 93,
    "content": "<p><img src=\"https://habrastorage.org/webt/jr/qh/hs/jrqhhsu6s-3ajgedg02jn2ljt0e.png\"></p><br>\r\n<p>Недавно, когда я просматривал новые возможности, которые будут включены в .Net 5, я натолкнулся на одну весьма интересную — генераторы исходного кода. Этот функционал меня особенно заинтересовал, так как я использую аналогичный подход в течение последних… 5 лет, и то, что предлагает Microsoft — это просто более глубокая интеграция этого подхода в процесс сборки проектов.</p><br>\r\n<p><em>Примечание: Оригинал был написан в момент, когда релиз .Net 5 только-только собирался выйти, но актуальности этот текст, на мой взгляд, не потерял, поскольку переход на новую версию платформы занимает какое-то время, да и принципы работы с Roslyn никак не поменялись.</em></p><br>\r\n<p>Далее я поделюсь своим опытом использования Roslyn при генерации кода, и надеюсь, что это поможет вам лучше понять, что именно предлагает Microsoft в .Net 5 и в каких случаях это можно использовать.</p> <a href=\"https://habr.com/ru/post/544274/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544274#habracut\">Читать дальше &rarr;</a>",
    "date": "2021-02-25T20:43:06",
    "image": "https://habrastorage.org/webt/jr/qh/hs/jrqhhsu6s-3ajgedg02jn2ljt0e.png",
    "starred": null
  },
  {
    "id": 706,
    "title": "[Перевод] Математики воскресили 13-ю проблему Гильберта",
    "guid": "https://habr.com/ru/post/544266/",
    "source_id": 93,
    "content": "<h3>Вопрос Давида Гильберта о многочленах седьмой степени, долгое время считавшийся решённым, открыл исследователям новую сеть математических связей</h3><br>\r\n<img src=\"https://habrastorage.org/getpro/habr/post_images/5a6/14d/52f/5a614d52f8fce51130fefcf0939ad610.jpg\"><br>\r\n<br>\r\nУспех в математике достигается редко. Спросите хотя бы <a href=\"https://math.uchicago.edu/~farb/\" rel=\"nofollow noopener noreferrer\">Бенсона Фарба</a>.<br>\r\n<br>\r\n«Проблема математики в том, что в 90% случаев вас ждёт неудача, и вам нужно быть человеком, умеющим это принимать», — сказал однажды Фарб за ужином с друзьями. Когда один из гостей, также математик, удивился тому, что Фарбу удаётся достигать успеха в целых 10% случаев, Фарб признал: «Нет, нет, я сильно преувеличил процент своих успехов».<br>\r\n<br>\r\nФарб, тополог из Чикагского университета, с радостью встретил последнюю свою неудачу – хотя, честно говоря, это не только его заслуга. Вопрос связан с задачей, парадоксальным образом одновременно решённой и нерешённой, открытой и закрытой.<br> <a href=\"https://habr.com/ru/post/544266/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544266#habracut\">Читать дальше &rarr;</a>",
    "date": "2021-02-25T18:40:32",
    "image": "https://habrastorage.org/getpro/habr/post_images/5a6/14d/52f/5a614d52f8fce51130fefcf0939ad610.jpg",
    "starred": null
  },
  {
    "id": 712,
    "title": "Деньги",
    "guid": "https://habr.com/ru/post/544252/",
    "source_id": 93,
    "content": "<p>В этой статье я кратко расскажу:<br>- что такое деньги;<br>- почему мир отказался от золотого стандарта;<br>- как связаны кредит, инфляция и резерв;<br>- что представляют собой криптовалюты, способны ли они заменить деньги.</p> <a href=\"https://habr.com/ru/post/544252/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544252#habracut\">Читать далее</a>",
    "date": "2021-02-25T17:46:07",
    "image": null,
    "starred": null
  },
  {
    "id": 704,
    "title": "Ресайклинг по-норвежски: ЦОДам предложили направлять излишки тепла на обогрев помещений",
    "guid": "https://habr.com/ru/post/544242/",
    "source_id": 93,
    "content": "<div style=\"text-align:center;\"><img src=\"https://habrastorage.org/webt/ju/nu/or/junuorr-rf7cverjnyzxpixw61k.png\"></div><br>\r\nВ Норвегии изучают вопрос вторичного использования тепла, выделяемого ЦОД. Предполагается, что тепло можно <a href=\"https://servernews.ru/1033330\" rel=\"nofollow noopener noreferrer\">направить</a> на бытовые и общественные нужды — обогрев зданий, производств, для рыбных хозяйств.<br>\r\n<br>\r\nПредложение поступило от Министра энергетики Норвегии — Тины Бру (Tina Bru). Инициатива распространяется на все компании с установленными крупными энергетическими установками.<br> <a href=\"https://habr.com/ru/post/544242/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544242#habracut\">Читать дальше &rarr;</a>",
    "date": "2021-02-25T16:18:13",
    "image": "https://habrastorage.org/webt/ju/nu/or/junuorr-rf7cverjnyzxpixw61k.png",
    "starred": null
  },
  {
    "id": 714,
    "title": "Почему язык Go стал стандартом для DevOps-инженеров",
    "guid": "https://habr.com/ru/post/544202/",
    "source_id": 93,
    "content": "<p>Иногда вещи находят себе применение неожиданно и не в том, для чего их задумывали.&nbsp;</p><p>В 1960-е годы Кен Томпсон — легенда программирования — написал компьютерную игру Space Travel для операционной системы Multics. Система была проектом компании Bell Lab, где он работал вместе с Денисом Ритчи. Позже проект закрыли, и чтобы продолжать играть в свою Space Travel, Томпсон решил портировать ее на компьютер PDP-7. Инструменты, которые он создал для порта, затем легли в основу операционной системы Unix.&nbsp;</p><p>Томпсон написал в одиночку первые три версии. Для Unix был нужен системный язык — так появился B. Позже Денис Ритчи, коллега и друг Томпсона, подхватил разработку и написал язык C. Вот так в основе почти всего, на чем построены современные технологии, лежало желание поиграть в компьютерную игру и пет-проекты для забавы.</p><p>Кен Томпсон построил блестящую карьеру исследователя в области computer science. В середине 2000-х он устроился в Google, где вместе с Робом Пайком и Робертом Грейсмером создал Golang — один из самых популярных языков последнего времени.</p> <a href=\"https://habr.com/ru/post/544202/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544202#habracut\">Читать далее</a>",
    "date": "2021-02-25T16:04:07",
    "image": null,
    "starred": null
  },
  {
    "id": 698,
    "title": "[Перевод] Использование Google Protocol Buffers (protobuf) в Java",
    "guid": "https://habr.com/ru/post/544204/",
    "source_id": 93,
    "content": "<p>Недавно вышло <a href=\"http://www.informit.com/store/effective-java-9780134685991\"><u>третье издание книги \"Effective Java\"</u></a> («Java: эффективное программирование»), и мне было интересно, что появилось нового в этой классической книге по Java, так как предыдущее издание охватывало только Java 6. Очевидно, что появились совершенно новые разделы, связанные с <a href=\"http://www.oracle.com/technetwork/java/javase/jdk7-relnotes-418459.html\"><u>Java 7</u></a>, <a href=\"http://www.oracle.com/technetwork/java/javase/8-whats-new-2157071.html\"><u>Java 8</u></a> и <a href=\"https://docs.oracle.com/javase/9/whatsnew/toc.htm\"><u>Java 9</u></a>, такие как глава 7 \"Lambdas and Streams\" («Лямбда-выражения и потоки»), раздел 9 \"Prefer try-with-resources to try-finally\" (в русском издании «2.9. Предпочитайте try-с-ресурсами использованию try-finally») и раздел 55 \"Return optionals judiciously\" (в русском издании «8.7. Возвращайте Optional с осторожностью»). Но я был слегка удивлен, когда обнаружил новый раздел, не связанный с нововведениями в Java, а обусловленный изменениями в мире разработки программного обеспечения. Именно этот раздел 85 \"Prefer alternatives to Java Serialization\" (в русском издании «12.1 Предпочитайте альтернативы сериализации Java») и побудил меня написать данную статью об использовании Google Protocol Buffers в Java.</p> <a href=\"https://habr.com/ru/post/544204/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544204#habracut\">Читать далее</a>",
    "date": "2021-02-25T15:55:22",
    "image": null,
    "starred": null
  },
  {
    "id": 709,
    "title": "[Перевод] Как выбрать мобильную кросс-платформу в 2021 году",
    "guid": "https://habr.com/ru/post/544228/",
    "source_id": 93,
    "content": "<p>Кросс-платформенные решения - тренд в мобильной разработке. Уже есть различные технологии от PWA до Flutter и Kotlin Multiplatform. Как выбрать среди них?</p><p>Новый развивающийся бизнес зачастую в первую очередь ориентируется на мобильные технологии: социальные сети, необанкинговые решения, приложения для электронной коммерции, такси и другие. Новый бизнес ориентирован на экономическую эффективность, поэтому переход на кросс-платформенность для разработки мобильного приложения кажется правильным выбором. Посмотрим, что будет в 2021 году и как выбрать правильную технологию.</p> <a href=\"https://habr.com/ru/post/544228/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544228#habracut\">Далее</a>",
    "date": "2021-02-25T15:34:14",
    "image": null,
    "starred": null
  },
  {
    "id": 713,
    "title": "Одноплатник Pimoroni Tiny 2040 — улучшенный аналог Raspberry Pi Pico, размером всего в треть «малинки»",
    "guid": "https://habr.com/ru/post/544230/",
    "source_id": 93,
    "content": "<div style=\"text-align:center;\"><img src=\"https://habrastorage.org/getpro/habr/post_images/779/19b/522/77919b522bceb377e52fbf95653606ad.webp\"></div><br>\r\nВ январе мы <a href=\"https://habr.com/ru/company/selectel/blog/538778/\">публиковали обзор</a> одноплатника Raspberry Pi Pico. В целом, соотношение цена/качество на высоте. Но многим пользователям платы не хватает дополнительных функций.<br>\r\n <br>\r\nИ вот сейчас появилась альтернатива, причем на основе SoC Raspberry RP2040, но с большим набором возможностей (забегая наперед — это не модуль беспроводной связи). Плюс ко всему, размер новинки всего третья часть от Raspberry Pi Pico. Называется это чудо технической мысли Pimoroni Tiny 2040.<br> <a href=\"https://habr.com/ru/post/544230/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544230#habracut\">Читать дальше &rarr;</a>",
    "date": "2021-02-25T15:13:21",
    "image": "https://habrastorage.org/getpro/habr/post_images/779/19b/522/77919b522bceb377e52fbf95653606ad.webp",
    "starred": null
  },
  {
    "id": 707,
    "title": "Как атаковали промышленную инфраструктуру на The Standoff: анализ трафика с помощью PT ISIM",
    "guid": "https://habr.com/ru/post/544224/",
    "source_id": 93,
    "content": "<p>На прошедшем The Standoff эксперты <a href=\"https://www.ptsecurity.com/ru-ru/services/esc/\"><u>PT Expert Security Center</u></a>, в данном случае представляющие команду глобального SOC киберполигона, мониторили действия команд атакующих и защитников цифровой копии мегаполиса FF, противостояние проходило в режиме реального времени и длилось 123 часа. Ранее мы писали о том, как глобальный SOC <a href=\"https://habr.com/ru/company/pt/blog/531206/\"><u>следил</u></a> за всем происходящим в инфраструктуре виртуального города, как отдел обнаружения вредоносного ПО <a href=\"https://habr.com/ru/company/pt/blog/533638/\"><u>вылавливал и исследовал</u></a> троянские программы «редтимеров» с помощью песочницы PT Sandbox и как мы <a href=\"https://habr.com/ru/company/pt/blog/538544/\"><u>следили</u></a> за всеми веб-ресурсами киберполигона с помощью PT Application Firewall. Теперь поговорим о защищенности технологических сетей объектов виртуального города и результатах мониторинга, проведенного с помощью системы глубокого анализа технологического трафика <a href=\"https://www.ptsecurity.com/ru-ru/products/isim/\"><u>PT Industrial Security Incident Manager</u></a> (PT ISIM).</p><p>В этой статье мы расскажем о том, какие атаки на технологический сегмент сети объектов города детектировала система, и отметим, насколько эти угрозы соответствуют реальному уровню защищенности промышленных систем.</p> <a href=\"https://habr.com/ru/post/544224/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544224#habracut\">Читать далее</a>",
    "date": "2021-02-25T15:02:05",
    "image": null,
    "starred": null
  },
  {
    "id": 696,
    "title": "Что такое процессное управление",
    "guid": "https://habr.com/ru/post/544216/",
    "source_id": 93,
    "content": "<p>В статье описаны наиболее распространенные модели управления, которые используются в российских в компании. В частности, дан сравнительный анализ характеристик функциональному и процессному подходу к организации системы управления.</p><p>Процессный подход был сформулирован во второй половине прошлого века и до сих пор остается одним из наиболее эффективных методов организации системы управления в компании. Краеугольным камнем данной методологии является понятие «процесс». Процесс — это совокупность взаимосвязанных видов деятельности, преобразующая входы в выходы, которые имеют ценность для потребителя. Таким образом, концепция процессного подхода, как системы управления, заключается в выделении конкретных бизнес-процессов компании, определении одного из участников в качестве владельца бизнес-процесса и делегировании ему полномочий и ответственности по управлению данным процессом.</p><p>В данном случае компания рассматривается, как система отдельных видов деятельности (бизнес-процессов), направленных на достижение конкретного результата и осуществляющих взаимодействие друг с другом посредством входов и выходов. В качестве входов в процессной методологии могут выступать: информация, документация, материалы, оборудование, человеческие ресурсы и так далее. Выходами бизнес-процессов является результат деятельности, который имеет ценность как для внешнего заказчика, так и для внутреннего. Стоит отметить, что важной отличительной особенностью процессного подхода от других моделей управления является не только выделение бизнес-процессов, но и постоянное их совершенствование.</p><p>К сожалению, несмотря на все достоинства и преимущества процессной методологии до сих пор в большинстве отечественных компаний используется функциональная модель управления. В отличие от процессного, в основе концепции функционального подхода к управлению делегирование полномочий и ответственности осуществляется через выполняемые функции. Другими словами, функциональный подход заключается в объединении сотрудников в отдельные структурные бизнес-единицы (отделы, департаменты и прочее) по принципу однообразия выполняемой деятельности с жесткой вертикальной иерархией.</p> <a href=\"https://habr.com/ru/post/544216/?utm_source=habrahabr&amp;utm_medium=rss&amp;utm_campaign=544216#habracut\">Читать далее</a>",
    "date": "2021-02-25T14:50:06",
    "image": null,
    "starred": null
  }
]