[{"id":731,"title":"GitHub опубликовал отчёт о блокировках в 2020 году","guid":"https://www.opennet.ru/opennews/art.shtml?num=54656","source_id":109,"content":"GitHub опубликовал ежегодный отчёт, в котором отражены поступившие за 2020 год уведомления о нарушении интеллектуальной собственности и публикации незаконного содержимого. В соответствии с действующим в США Законом об авторском праве в цифровую эпоху (DMCA, Digital Millennium Copyright Act), в 2020 году GitHub получил 2097 требований о блокировке, охватывающих 36901 проектов. Для сравнения, в 2019 году поступило 1762 запросов о блокировке, охвативших 14371 проектов, в 2018 году - 1799, 2017 году - 1380, в 2016 году - 757, в 2015 году - 505, а в 2014 году - 258.  От владельцев репозиториев поступило 37 опровержений на неправомерную блокировку.","date":"2021-02-25T20:31:41","image":null,"starred":null},{"id":728,"title":"Red Hat Enterprise Linux стал бесплатен для организаций, развивающих открытое ПО","guid":"https://www.opennet.ru/opennews/art.shtml?num=54655","source_id":109,"content":"Компания Red Hat продолжила расширение программ по бесплатному использованию Red Hat Enterprise Linux, закрывающих потребности пользователей в традиционном CentOS, возникшие после трансформации проекта CentOS в CentOS Stream. В дополнение к ранее предоставленным  бесплатным сборкам для рабочих внедрений (production), насчитывающих до 16 систем, предложена новая опция \"Red Hat Enterprise Linux (RHEL) for Open Source Infrastructure\", которая позволяет без ограничений бесплатно использовать RHEL в инфраструктуре сообществ разработчиков открытых проектов и организаций, поддерживающих разработку открытого ПО.","date":"2021-02-25T18:46:59","image":null,"starred":null},{"id":685,"title":"Проект Debian запустил сервис для динамического получения отладочной информации","guid":"https://www.opennet.ru/opennews/art.shtml?num=54652","source_id":109,"content":"Дистрибутив Debian ввёл в строй новый сервис debuginfod, позволяющий при отладке поставляемых в дистрибутиве программ обойтись без отдельной установки связанных с ними пакетов с отладочной информацией из репозитория debuginfo. Запущенный сервис даёт возможность использовать появившуюся в GDB 10 функциональность динамической загрузки отладочных символов с внешнего сервера непосредственно во время отладки.","date":"2021-02-25T11:13:00","image":null,"starred":null},{"id":676,"title":"Проблема с загрузкой Linux на Intel NUC7PJYH, всплывшая после обновления BIOS 0058","guid":"https://www.opennet.ru/opennews/art.shtml?num=54651","source_id":109,"content":"Обладатели мини-компьютера Intel NUC7PJYH на базе CPU ex-Atom Intel Pentium J5005 Gemini Lake столкнулись с проблемой работы Linux и Unix-подобных операционных систем после обновления BIOS до версии 0058. Вплоть до использования BIOS 0057 с работой Linux, FreeBSD, NetBSD проблем не возникало (была отдельная проблема с OpenBSD), но после обновления BIOS до версии 0058 на данном компьютере из-за проблемы с ACPI произошёл сбой при использовании Linux и Unix-подобных операционных систем. Лицензионная Windows 10 на этом компьютере работала нормально.","date":"2021-02-25T10:58:01","image":null,"starred":null},{"id":683,"title":"GitHub документировал механизм блокировки всей сети форков","guid":"https://www.opennet.ru/opennews/art.shtml?num=54647","source_id":109,"content":"Компания GitHub внесла изменения в правила обработки жалоб, ссылающихся на нарушение действующего в США Закона об авторском праве в цифровую эпоху (DMCA). Изменения касаются блокировки форков и определяют возможность автоматического блокирования всех форков репозитория, в котором подтверждено нарушение чужой интеллектуальной собственности.","date":"2021-02-25T07:12:47","image":null,"starred":null},{"id":686,"title":"Релиз дистрибутива для исследования безопасности Kali Linux 2021.1","guid":"https://www.opennet.ru/opennews/art.shtml?num=54648","source_id":109,"content":"Состоялся релиз дистрибутива  Kali Linux 2021.1, предназначенного для тестирования систем на предмет наличия уязвимостей, проведения аудита, анализа остаточной информации и выявления последствий атак злоумышленников. Все оригинальные наработки, созданные в рамках дистрибутива, распространяются под лицензией GPL и доступны через публичный Git-репозиторий. Для загрузки подготовлены несколько вариантов iso-образов, размером 380 МБ, 3.4 ГБ и 4 ГБ. Сборки доступны для архитектур x86, x86_64, ARM (armhf и armel, Raspberry Pi, Banana Pi, ARM Chromebook, Odroid). По умолчанию предлагается рабочий стол Xfce, но опционально поддерживаются KDE, GNOME, MATE, LXDE и Enlightenment e17.","date":"2021-02-25T06:24:26","image":null,"starred":null},{"id":675,"title":"Google профинансирует работу по повышению безопасности ядра Linux","guid":"https://www.opennet.ru/opennews/art.shtml?num=54646","source_id":109,"content":"Организация Linux Foundation объявила о предоставлении компанией Google финансирования работы по сопровождению механизмов защиты в ядре Linux и усилению безопасности ядра. В режиме полного рабочего дня будут трудоустроены Густаво Сильва (Gustavo Silva) и Натан Ченслор (Nathan Chancellor).","date":"2021-02-24T19:30:31","image":null,"starred":null},{"id":674,"title":"Релиз платформы OroPlatform 4.2.1 LTS, а также приложений OroCommerce и OroCRM","guid":"https://www.opennet.ru/opennews/art.shtml?num=54645","source_id":109,"content":"Состоялся релиз OroPlatform 4.2.1 LTS, открытой платформы бизнес-приложений (BAP), разрабатываемой компанией ORO. Платформа предназначена для упрощения и ускорения разработки индивидуальных бизнес-приложений. Код OroPlatform написан на языке PHP и распространяется под лицензией MIT.","date":"2021-02-24T18:21:07","image":null,"starred":null},{"id":681,"title":"Выпуск глобальной децентрализованной файловой системы IPFS 0.8","guid":"https://www.opennet.ru/opennews/art.shtml?num=54644","source_id":109,"content":"Представлен выпуск децентрализованной файловой системы IPFS 0.8 (InterPlanetary File System), образующей глобальное версионированное хранилище файлов, развёрнутое в форме P2P-сети, образованной из систем участников. IPFS комбинирует идеи, ранее реализованные в таких системах, как  Git, BitTorrent, Kademlia, SFS и Web, и напоминает единый \"рой\" BitTorrent (пиры, участвующие в раздаче), обменивающийся Git-объектами. IPFS отличается адресацией по содержимому, а не месту размещения и произвольным именам. Код эталонной реализации написан на языке Go и распространяется под лицензиями  Apache 2.0 и MIT.","date":"2021-02-24T15:01:47","image":null,"starred":null},{"id":684,"title":"Выпуск Tor Browser 10.0.12 и дистрибутив Tails 4.16","guid":"https://www.opennet.ru/opennews/art.shtml?num=54643","source_id":109,"content":"Сформирован релиз специализированного дистрибутива Tails 4.16 (The Amnesic Incognito Live System), основанного на пакетной базе Debian и предназначенного для обеспечения анонимного выхода в сеть. Анонимный выход в Tails обеспечивается системой Tor. Все соединения, кроме трафика через сеть Tor, по умолчанию блокируются пакетным фильтром. Для хранения пользовательских данных в режиме сохранения пользовательских данных между запусками применяется шифрование. Для загрузки подготовлен iso-образ, способный работать в Live-режиме, размером 1.1 ГБ.","date":"2021-02-24T10:50:33","image":null,"starred":null},{"id":680,"title":"Уязвимости во FreeBSD, позволяющие обойти ограничения jail-окружений","guid":"https://www.opennet.ru/opennews/art.shtml?num=54642","source_id":109,"content":"В развиваемой проектом FreeBSD системе изолированных окружений jail выявлены две уязвимости.","date":"2021-02-24T08:55:42","image":null,"starred":null},{"id":677,"title":"Релиз Firefox 86","guid":"https://www.opennet.ru/opennews/art.shtml?num=54632","source_id":109,"content":"Состоялся релиз web-браузера Firefox 86. Кроме того, сформировано обновление ветки с длительным сроком поддержки 78.8.0. На стадию бета-тестирования  переведена ветка Firefox 87, релиз которой намечен на 23 марта.","date":"2021-02-23T14:28:18","image":null,"starred":null}]